<template>
    <div class="PhotoVue"  text-align: center>
        <h1>«Гетери у Vuex».</h1>
        <h3><p>Геттери - це частина сховища Vuex, які повертають обчислювані дані поточного стану сховища нашим компонентів.</p></h3>
        <h3><p>Коли компонент повинен використовувати безліч властивостей або геттеров сховища, оголошувати всі ці обчислювані властивості може бути утомливо. У таких випадках можна використовувати функцію mapState , яка автоматично генерує обчислювані властивості.</p></h3>
         <h3><p>Якщо потрібно перевикористати один і той же геттер в різних компонентах, може бути не зовсім зручно прописувати геттери кожен раз в методі computed. На допомогу приходить mapGetters </p></h3>
         <ul>
             <li>Геттери використовуються коли вам вивести модифіковану інформацію зі сховища (наприклад список всіх прочитаних книг), в інших випадках можна використати допоміжну функцію mapState.</li>
             <li>Геттерам можна передавати додаткові аргументи, щоб проводити обчислення даних на їх основі.</li>
             <li>Результати геттера оновлюються при зміні однієї з залежностей.</li>
         </ul>
</template>
<script>
export default
{
  name:"App",
  data()
  { return{
  
  }
  }

}
</script>

<style scoped>

.PhotoVue{
position: absolute;
border-radius: 10px 60px 30px;
width: 900px;
height: 600px;
position: relative;

text-align: center;
 margin: auto;

}
h1{
 font-family: "Courier New";
     font-size: 50px;
     color:  #86760a;
}
h3
{
 font-family: "Courier New";
     font-size: 20px;
     color:  #7a0975;
}
li
{
    font-family: "Courier New";
     font-size: 20px;
     color:  #7a0975; 

}
 
</style>